from pyDatalog import pyDatalog


"""
Задание 2
Посчитать среднее значение ряда
"""


pyDatalog.create_terms('meanRow, N')

meanRow[N] = (N + 1)/2

print(meanRow[100]==N)


